# 5. Написать функцию, возвращающую среднее арифметическое элементам переданного ей списка.

print("\n===================================\n")


def cal_avg(list_num):
    return sum(list_num) / len(list_num)


def main():
    print("Среднее арифметическое:", cal_avg([11, 22, 34, 25, 1]))


main()

print("\n===================================\n")
