# 14.2 Выполнить все три практики в конце презентации по циклам.
# Показать на экране ступеньки. Количество ступеней (например,5) указывает пользователь.

print("\n")
while True:
    steps = input("Введите количество ступеней: ")

    if steps.isdigit():
        steps = int(steps)
        break
    else:
        print("Некорректный ввод! Введи число\n")

print("\n==========================\n")

# Без условия
for i in range(steps):
    print(" " * (i * 2) + "***")
    print(" " * (i * 2 + 2) + "*")

# С условием
for i in range(steps * 2):
    if i % 2 == 0:
        print(" " * i + "***")
    else:
        print(" " * (i + 1) + "*")

print("\n==========================\n")
