# 2. Показать номера и общее количество всех счастливых трамвайных билетов
# с шестизначными номерами.

print("\n==========================\n")

num_count = 0
line_count = 0

for i in range(1000000):
    num_left = i // 1000
    num_right = i % 1000

    if ((num_left // 100) + (num_left // 10 % 10) + (num_left % 10)) == (
        (num_right // 100) + (num_right // 10 % 10) + (num_right % 10)
    ):
        num_count += 1
        line_count += 1
        print(f"{i:06}", end=" ")
    if line_count == 15:
        print()
        line_count = 0

# Для отображения всех чисел нужно открыть программу
# в отдельной консоли, или файлом. (запустится в консоли)
print("\n\n==========================")
print("==========================\n")
print(f"Всего счастливых билетов: {num_count}")
print("\n==========================")
print("==========================\n")

input()  # Для задержки консоли
