# 16. Написать программу, показывающую таблицу умножения (таблица Пифагора).

print("\n==========================\n")

for i in range(1, 11):
    for j in range(1, 11):
        print(f"{i * j:<3}", end="")
    print("\n")

print("\n==========================\n")
