# 20. Показать на экране все числа Фибоначчи в диапазоне от 0 до 10.000.000.

print("\n==========================\n")
num1 = 0
num2 = 0
num3 = 1

print("Способ через 3 переменные")
while num1 < 10000000:
    print(num1, end=" | ")
    num2 = num1 + num3
    num1 = num3
    num3 = num2

print("\n\n==========================\n")

num1 = 0
num2 = 1
print("Способ через 2 переменные")
while num1 < 10000000:
    print(num1, end=" | ")
    num1, num2 = num2, num1 + num2

print("\n\n==========================\n")
