# 5. Написать программу, которая проверяет корректность email, указанного с клавиатуры.

import re

print(f"\n{"Инициализация":=^35}\n")

email = input("Напишите вашу электронную почту: ")

print("\n===================================\n")

check = r"(^[a-zA-Z0-9]+([.-_][a-zA-Z0-9]+)*@([a-zA-Z0-9]+(-[a-zA-Z0-9]+)*\.)+[a-zA-Z]{2,}$)"

match = re.search(check, email)

if match:
    print("Ваша почта валидна")
else:
    print("Ваша почта невалидна")

print("\n===================================\n")
