# 5. Напишите программу, которая находит среднее арифметическое значение трех
# введенных дробных чисел.

print("\n")

num1 = float(input("Введите первое число: "))
num2 = float(input("Введите втрое число: "))
num3 = float(input("Введите третье число: "))

avg = (num1 + num2 + num3) / 3

print("\n")

print("Среднее арифметическое трех чисел равно: ", avg)

print("\n")
