# 4. Пользователь вводит с клавиатуры температуру по шкале Цельсия.
# Надо перевести температуру в градусы по Фаренгейту и вывести на экран.

print("\n")

Celsius = float(input("Сколько градусов °C: "))
fahrenheit = Celsius * 1.8 + 32

print("\n")

print(Celsius, "°C =", fahrenheit, "°F")

print("\n")
