# 6. Пользователь вводит число и степень. Программа вычисляет указанную степень этого числа.

print("\n")

number = int(input("Введите число: "))
degree = int(input("Введите степень: "))
result = number**degree

print("\n")

print("Результат возведения числа", number, "в степень", degree, "равен", result)

print("\n")
