# 3. Напишите программу, которая вычисляет площадь прямоугольника.
# Пользователь с клавиатуры вводит ширину и высоту прямоугольника.

print("\n")

width = float(input("Введите ширину: "))
height = float(input("Введите высоту: "))

print("\n")

S = width * height
print("Площадь прямоугольника составила", S)

print("\n")
