# 1. Пользователь вводит с клавиатуры два числа. Необходимо найти сумму чисел,
# разность чисел, произведение чисел. Результат вычислений выводится на экран.

print("\n")

num1 = float(input("Введите число 1: "))
num2 = float(input("Введите число 2: "))

print("\n")

print("Сумма", num1, "+", num2, "=", num1 + num2)
print("Разность", num1, "-", num2, "=", num1 - num2)
print("Произведение", num1, "*", num2, "=", num1 * num2)
print("Частное", num1, "/", num2, "=", num1 / num2)

print("\n")
