# 1. Создать список из 5 чисел, затем вывести его в обратном порядке.

print("\n===================================\n")

numbers = [1, 2, 3, 4, 5]

print(f"Список: {numbers}")
print(f"Список в обратном порядке: {numbers[::-1]}")

print("\n===================================\n")
