# 8. Ввести число в диапазоне от 0 до 1 000 000. Озвучить его словами.
# К примеру, при вводе числа 25 вывести на экран «двадцать пять».

print("\n===================================\n")

while True:
    num = input("Введите число: ")

    if num.isdigit() and int(num) >= 0 and int(num) <= 1000000:
        num = int(num)
        break
    else:
        print("Введите положительное целое число от 0 до 1000000\n")

print("\n===================================\n")

text_num = ""

if num == 0:
    text_num = "Ноль"
elif num == 1000000:
    text_num = "Один миллион"
    num -= 1000000


numbers = {
    4000: "четыре тысячи",
    3000: "три тысячи",
    2000: "две тысячи",
    1000: "одна тысяча",
    900: "девятьсот",
    800: "восемьсот",
    700: "семьсот",
    600: "шестьсот",
    500: "пятьсот",
    400: "четыреста",
    300: "триста",
    200: "двести",
    100: "сто",
    90: "девяносто",
    80: "восемьдесят",
    70: "семьдесят",
    60: "шестьдесят",
    50: "пятьдесят",
    40: "сорок",
    30: "тридцать",
    20: "двадцать",
    19: "девятнадцать",
    18: "восемнадцать",
    17: "семнадцать",
    16: "шестнадцать",
    15: "пятнадцать",
    14: "четырнадцать",
    13: "тринадцать",
    12: "двенадцать",
    11: "одиннадцать",
    10: "десять",
    9: "девять",
    8: "восемь",
    7: "семь",
    6: "шесть",
    5: "пять",
    4: "четыре",
    3: "три",
    2: "два",
    1: "один",
}


thousands = 0
while num >= 5000:
    thousands = num // 1000
    if thousands not in numbers:
        if thousands > 100:
            thousands -= thousands % 100
            text_num += " " + numbers[thousands]
            num -= thousands * 1000
            continue
        else:
            thousands -= thousands % 10
            text_num += " " + numbers[thousands]
            num -= thousands * 1000
            continue
    if thousands >= 5:
        text_num += " " + numbers[thousands] + " тысяч"
        num -= num // 1000 * 1000

for value in numbers:
    while num >= value:
        text_num += " " + numbers[value]
        num -= value


print(f"{text_num:^33}")

print("\n===================================\n")
