# 24. Написать игру "Первый миллион". Появляются вопросы и 4 варианта ответов
# при неправильном выборе игра заканчивается, при правильном
# переходим к следующему вопросу. Минимум 5 вопросов на разные темы.

print(
    """
  |==================================================|
  |             Добро пожаловать в игру              |
  |                 'Первый миллион'                 |
  |==================================================|

            Ответьте правильно на все вопросы
                чтобы выиграть миллион"""
)

print(
    """
  |==================================================|
  |                    Вопрос 1                      | 
  |==================================================|
  |          Какой автомобиль был первым?            | 
  |==================================================|
  |  1. Ford Model T       |  2. Mercedes-Benz 1886  |
  |--------------------------------------------------|
  |  3. Volkswagen Beetle  |  4. BMW 328             |
  |==================================================|
      """
)
print("==================================")
answer = input("Ваш ответ: ")

if answer == "1" or answer == "Ford Model T":
    print("\nПравильный ответ!")
    print("==================================")
else:
    print("\nНеправильный ответ. Игра окончена.")
    print("==================================")
    exit()

print(
    """
  |============================================|
  |                  Вопрос 2                  |
  |============================================|
  |      Кто самый быстрый хищник в мире?      |
  |============================================|
  |  1. Гепард          |  2. Лев              |
  |--------------------------------------------|
  |  3. Ягуар           |  4. Тигр             |
  |============================================|
      """
)
print("==================================")
answer = input("Ваш ответ: ")
if answer == "1" or answer == "Гепард":
    print("\nПравильный ответ!")
    print("==================================")
else:
    print("\nНеправильный ответ. Игра окончена.")
    print("==================================")
    exit()

print(
    """
  |=========================================================|
  |                         Вопрос 3                        | 
  |=========================================================|
  |         Кто написал музыку к "Лебединому озеру"?        | 
  |=========================================================|
  | 1. Фредерик Шопен           | 2. Людвиг ван Бетховен    |
  |---------------------------------------------------------|
  | 3. Вольфганг Амадей Моцарт  | 4. Пётр Ильич Чайковский  |
  |=========================================================|
      """
)
print("==================================")
answer = input("Ваш ответ: ")
if answer == "4" or answer == "Пётр Ильич Чайковский":
    print("Правильный ответ!")
    print("\n==================================")
else:
    print("Неправильный ответ. Игра окончена.")
    print("\n==================================")
    exit()

print(
    """
  |==============================================|
  |                   Вопрос 4                   | 
  |==============================================|
  |     Кто был первым человеком в космосе?      | 
  |==============================================|
  |  1. Нил Армстронг        |  2. Юрий Гагарин  |
  |----------------------------------------------|
  |  3. Валентина Терешкова  |  4. Герман Титов  |
  |==============================================|
      """
)
print("==================================")
answer = input("Ваш ответ: ")
if answer == "2" or answer == "Юрий Гагарин":
    print("\nПравильный ответ!")
    print("==================================")
else:
    print("\nНеправильный ответ. Игра окончена.")
    print("==================================")
    exit()

print(
    """
  |========================================|
  |                Вопрос 5                |
  |========================================|
  |    Кто был первым императором Рима?    | 
  |========================================|
  |  1. Юлий Цезарь      |  2. Нерон       |
  |----------------------------------------|
  |  3. Октавиан Август  |  4. Тиберий     |
  |========================================|
      """
)
print("==================================")
answer = input("Ваш ответ: ")
if answer == "3" or answer == "Октавиан Август":
    print("\nПравильный ответ!")
    print("==================================")
else:
    print("\nНеправильный ответ. Игра окончена.")
    print("==================================")
    exit()

print(
    """
  |==================================================|
  |        ПОЗДРАВЛЯЕМ, ВЫ ПРОШЛИ ВСЕ ВОПРОСЫ!       |
  |==================================================|
  |               Вы выиграли миллион!               |
  |==================================================|
"""
)
